from ArchMageFirePoison import 火毒魔導士
from ArchMageIceLightning import 冰雷魔導士
from Beginner import 初心者
from Wizard import 法師

def 印狀態(w, x, y = None, z = None):
    w.狀態()
    print()
    x.狀態()
    if(y != None):
        print()
        y.狀態()
    if(z != None):
        print()
        z.狀態()

郭乃文 = 火毒魔導士(姓名 = "光之協奏者", 攻擊力 = 25)
曾奕銓 = 冰雷魔導士(姓名 = "暗之協奏者", 攻擊力 = 25)
呂政豪 = 初心者(姓名 = "影之協奏者")
王嘉源 = 法師(姓名 = "幻之協奏者")

print("========================")
print("初始狀態:")
印狀態(郭乃文, 曾奕銓, 呂政豪, 王嘉源)
print("========================")

i = 1
是否為郭乃文回合 = True

while(True):
    try:
        if(郭乃文.血量 <= 0 or 曾奕銓.血量 <= 0):
            print("遊戲結束...")
            if(郭乃文.血量 <= 0):
                print(f"{曾奕銓.姓名} 勝")
            elif(曾奕銓.血量 <= 0):
                print(f"{郭乃文.姓名} 勝")
            break
        
        print(f"第{i}回合戰況:")
        
        要使用甚麼技能 = 0
        
        if(是否為郭乃文回合):
            print(f"該回合為 {郭乃文.姓名} 回合...")
            
            while(要使用甚麼技能 != 1 and 要使用甚麼技能 != 2 and 要使用甚麼技能 != 3):
                要使用甚麼技能 = int(input(f"請輸入要使用甚麼技能，可選技能有 {郭乃文.技能列()}:"))
            
            if(要使用甚麼技能 == 1):
                郭乃文.普通攻擊(曾奕銓)
            elif(要使用甚麼技能 == 2):
                郭乃文.魔法攻擊(曾奕銓)
            elif(要使用甚麼技能 == 3):
                郭乃文.火毒攻擊(曾奕銓) 
            是否為郭乃文回合 = False
        else:
            print(f"該回合為 {曾奕銓.姓名} 回合...")
            
            while(要使用甚麼技能 != 1 and 要使用甚麼技能 != 2 and 要使用甚麼技能 != 3):
                要使用甚麼技能 = int(input(f"請輸入要使用甚麼技能，可選技能有 {曾奕銓.技能列()}:"))
            
            if(要使用甚麼技能 == 1):
                曾奕銓.普通攻擊(郭乃文)
            elif(要使用甚麼技能 == 2):
                曾奕銓.魔法攻擊(郭乃文)
            elif(要使用甚麼技能 == 3):
                曾奕銓.冰雷攻擊(郭乃文) 
            是否為郭乃文回合 = True
        
        print("\n玩家狀態:")
        印狀態(郭乃文, 曾奕銓)
        print("========================")
        i = i + 1

    except:
        print("發生錯誤")
        print("========================")